In [2]:
import pandas as pd
import numpy as np

In [19]:
d = {'A':[1,np.nan, np.nan],'B':[7,np.nan,3],'C':[1,2,3]}

In [20]:
df = pd.DataFrame(d)

In [21]:
df

     A    B  C
0  1.0  7.0  1
1  NaN  NaN  2
2  NaN  3.0  3

In [22]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [23]:
df.dropna(thresh=2)

     A    B  C
0  1.0  7.0  1
2  NaN  3.0  3

In [24]:
df

     A    B  C
0  1.0  7.0  1
1  NaN  NaN  2
2  NaN  3.0  3

In [25]:
df.fillna(value = 'FILL VALUE')

            A           B  C
0         1.0         7.0  1
1  FILL VALUE  FILL VALUE  2
2  FILL VALUE         3.0  3

In [28]:
df['A'].fillna(value=df['A'].sum())

0    1.0
1    1.0
2    1.0
Name: A, dtype: float64